[gold]
read_verilog -sv ../problem/solution.v
prep -top top_module
memory_map
select -module top_module 
delete *_DontCare*

[gate]
read_verilog -sv ../submission/program.v
prep -top top_module
memory_map
select -module top_module 
delete *_DontCare*

[collect *]

[strategy induction]
use sby
depth %depth%
engine %engine% %solver%