read_verilog -sv submission/program.v

tee -q synth -auto-top

stat
abc -g NAND