read_verilog -sv problem/solution.v

write_verilog -noattr correction/yosys/solution/solution.v

tee -q synth -auto-top

stat
abc -g NAND