read_verilog submission/program.v

tee -q synth

stat
abc -g NAND